[
  {
    "id": 1,
    "title": "Zero-Waste Tote Bag from Old T-Shirts",
    "materials": [
      "Old t-shirt (preferably thick material)",
      "Scissors",
      "Non-permanent marker"
    ],
    "image":"assets/images/diyImages/diy_1.png"
    ,
    "steps": [
      "Lay the old t-shirt flat on a surface.",
      "Cut off both sleeves and the neckline. For neater results, fold the shirt lengthwise and cut both sides simultaneously.",
      "Cut vertical strips at the bottom of the shirt to make fringes (about 10-15 cm). Don’t cut past the bottom seam.",
      "Turn the shirt inside out.",
      "Tie each pair of front and back fringe strips together tightly.",
      "Once done, turn the bag right side out again.",
      "The tote bag is ready, with the sleeve holes serving as handles."
    ],
     "description": "Turn an old t-shirt into a no-sew tote bag using just scissors and simple knots. Fast, eco-friendly, and perfect for daily use.",
    "youtube": "https://youtu.be/piP_ozqkYQo"
  },
  {
  "id": 2,
  "title": "Solar Bottle Lamp: Natural Light from Water & Bleach",
  "materials": [
    "Clear plastic bottle (1–2 liters)",
    "Clean water",
    "Bleach",
    "Waterproof sealant",
    "Thin metal sheet (optional, for roof mounting)"
  ],
  "image": "assets/images/diyImages/diy_2.png",
  "steps": [
    "Choose a clean, transparent plastic bottle.",
    "Fill the bottle almost to the top with clean water.",
    "Add a small amount of bleach to prevent algae growth.",
    "Cut a hole in the roof (e.g., tin or metal roofing) to fit the bottle.",
    "Insert the bottle into the hole, allowing the bottom part to hang into the room.",
    "Use a metal sheet to lock the bottle in place on the roof if needed.",
    "Apply waterproof sealant around the hole and bottle to prevent leaks.",
    "During the daytime, sunlight will refract through the water-filled bottle, lighting up the room like a 40–60 watt bulb."
  ],
  "description": "Create an eco-friendly solar lamp using a plastic bottle, water, and a bit of bleach. This simple solution brings natural daylight into dark indoor spaces, especially useful in areas with limited electricity.",
  "youtube": "https://youtu.be/KhY_KPApThM"
},
  {
    "id": 3,
    "title": "Produce Bag from Sheer Fabric",
    "materials": [
      "Thin fabric (e.g. tulle, organdy)",
      "Drawstring cord or handmade fabric string",
      "Scissors",
      "Needle and thread or sewing machine",
      "Safety pin"
    ],
    "image":"assets/images/diyImages/diy_3.png"
    ,
    "steps": [
      "Cut a rectangle of fabric to your preferred size (e.g. 30x40 cm).",
      "Fold the fabric in half with the good sides facing each other.",
      "Sew along the sides and bottom, leaving the top open.",
      "Fold the top edge inward about 2–3 cm and sew to create a casing for the drawstring. Leave a small gap.",
      "Use a safety pin to thread the drawstring through the casing.",
      "Tie the ends of the string together.",
      "The produce bag is ready to use."
    ],
    "description": "Create a reusable produce bag using sheer fabric and a drawstring. Lightweight, washable, and ideal for shopping sustainably.",
    "youtube": "https://youtu.be/KuuDwKA8XIs?si=MADPnnxZZz0dxkh3"
  },
  {
    "id": 4,
    "title": "Zero-Waste Market Bag (Mesh Style)",
    "materials": [
      "Stretchy old t-shirt",
      "Sharp scissors or rotary cutter",
      "Ruler"
    ],
    "image":"assets/images/diyImages/diy_4.png"
    ,
    "steps": [
      "Cut off the sleeves and neckline of the t-shirt.",
      "Cut off the bottom seam of the shirt.",
      "Lay the shirt flat and make horizontal slits across the body, spaced 2–3 cm apart.",
      "Leave about 5 cm uncut at the top and bottom.",
      "Stretch the fabric vertically to curl the strips into a mesh shape.",
      "Use the former sleeve holes as handles.",
      "The mesh market bag is ready for shopping."
    ],
     "description": "Transform a stretchy t-shirt into a mesh-style market bag without sewing. Just cut, stretch, and reuse!",
    "youtube": "https://youtu.be/SZ7NKu76cRo?si=KKgd4O3hTzUrR7xP"
  },
  {
    "id": 5,
    "title": "Organizer from Plastic Bottle and Fabric",
    "materials": [
      "Used plastic bottle",
      "Scrap fabric or cotton",
      "Hot glue gun",
      "Scissors or cutter",
      "Optional: lace, ribbon"
    ],
    "image":"assets/images/diyImages/diy_5.png"
    ,
    "steps": [
      "Wash and dry the plastic bottle thoroughly.",
      "Cut off the top part of the bottle using scissors or a cutter.",
      "Smooth the edges if needed.",
      "Measure the bottle’s circumference and height.",
      "Cut a piece of fabric slightly larger than these dimensions.",
      "Glue the fabric around the outer surface of the bottle.",
      "Fold and glue any excess fabric into the inner rim.",
      "Optionally decorate with ribbon or lace.",
      "Your fabric-covered bottle organizer is complete."
    ],
    "description": "Upcycle a plastic bottle into a cute organizer by covering it with fabric and decorating it with ribbon or lace.",
    "youtube": "https://youtu.be/XevxYB8Hrzg?si=83jly_-NPzMtbZHa"
  },
  {
    "id": 6,
    "title": "Stationery Holder from Cardboard and Fabric",
    "materials": [
      "Thick cardboard (e.g. from a shoebox)",
      "Colorful fabric scraps",
      "White glue or hot glue",
      "Scissors or cutter",
      "Ruler and pencil"
    ],
    "image":"assets/images/diyImages/diy_6.png"
    ,
    "steps": [
      "Sketch the shape and size of your stationery holder.",
      "Cut cardboard pieces according to the design.",
      "Assemble the frame using hot glue.",
      "Apply glue to the outside of the structure.",
      "Attach fabric pieces, smoothing out bubbles.",
      "Trim excess fabric and neatly fold edges inside.",
      "Optional: line the inside with fabric too.",
      "Let dry completely before use."
    ],
    "description": "Make your own desk organizer with cardboard and fabric. A fun, eco-friendly way to tidy up your workspace.",
    "youtube": "https://youtu.be/lxBbJKS8gBw?si=266toyPpSj9K6u2z"
  },
  {
    "id": 7,
    "title": "Mini Shelf from Cardboard and Fabric",
    "materials": [
      "Extra thick cardboard",
      "Thick fabric (canvas or cotton)",
      "Hot glue and white glue",
      "Cutter and metal ruler",
      "Pencil"
    ],
    "image":"assets/images/diyImages/diy_7.png"
    ,
    "steps": [
      "Draw a design for a mini shelf (e.g. two-tier).",
      "Cut all shelf components from cardboard (double-layered for strength).",
      "Glue layers together to strengthen each part.",
      "Assemble the shelf frame using hot glue.",
      "Measure and cut fabric for each surface, adding a few centimeters for folding.",
      "Glue fabric to the outside, folding edges neatly.",
      "Glue in horizontal shelf layers (shelves) inside the frame.",
      "Ensure everything is covered and well-attached.",
      "Let dry and start organizing light items."
    ],
    "description": "Build a mini shelf using sturdy cardboard and fabric. Great for storing lightweight items while adding a personal touch to your room.",
    "youtube": "https://youtu.be/7ArqiIy2lp4?si=SImkZN6CVO32vsqr"
  },
  {
    "id": 8,
    "title": "Organizer from Bottle and Wool Yarn",
    "materials": [
      "Used plastic or glass bottle",
      "Wool yarn or thick thread in various colors",
      "Hot glue",
      "Scissors"
    ],
    "image":"assets/images/diyImages/diy_8.png"
    ,
    "steps": [
      "Clean and dry the bottle.",
      "Apply a dab of glue at the bottom and start attaching the yarn.",
      "Wrap the yarn tightly and evenly around the bottle.",
      "Add glue every few turns to keep it secure.",
      "To change colors, cut the yarn, glue the end, and start with a new color.",
      "Continue wrapping until the whole bottle is covered.",
      "Secure the final end with glue.",
      "The yarn-covered bottle is now a decorative organizer."
    ],
    "description": "Wrap an old bottle with colorful yarn to create a beautiful, decorative organizer. Simple, stylish, and sustainable.",
    "youtube": "https://youtu.be/ATeHydXrfDw?si=ZKlYLER4NrTmL_ih"
  },
  {
    "id": 9,
    "title": "Denim Bag from Old Jeans",
    "materials": [
      "Old jeans",
      "Scissors",
      "Needle and thread or sewing machine",
      "Ruler or measuring tape",
      "Fabric marker",
      "Optional: buttons, zipper, or straps"
    ],
    "description": "Give your jeans a second life! This tutorial shows how to turn old denim into a stylish tote bag with optional zippers and pockets.",
    "image":"assets/images/diyImages/diy_9.png"
    ,
    "steps": [
      "Cut one leg of the jeans according to the height you want for the bag.",
      "Turn the fabric inside out.",
      "Sew straight across the bottom to close it.",
      "Flatten the bottom corners into triangles and sew across to form the bag base.",
      "Cut two long strips from leftover fabric for the straps.",
      "Sew the straps onto the top of the bag.",
      "Flip the bag right side out.",
      "Decorate with pockets, buttons, or other embellishments."
    ],
    "youtube": "https://youtu.be/sYLdNrjGT1U?si=UXGp4wZqwkyw3azx"
  }
]
