[
  {
    "id": 1,
    "content": "The Earth is now about 1.2°C warmer than in pre-industrial times."
  },
  {
    "id": 2,
    "content": "The 10 hottest years on record have all occurred since 2010."
  },
  {
    "id": 3,
    "content": "Arctic sea ice is shrinking by nearly 13% per decade since the 1980s."
  },
  {
    "id": 4,
    "content": "Atmospheric CO₂ levels have exceeded 420 ppm, the highest in 800,000 years."
  },
  {
    "id": 5,
    "content": "Oceans absorb about 90% of the excess heat from global warming."
  },
  {
    "id": 6,
    "content": "Melting glaciers contribute over 30% to sea level rise."
  },
  {
    "id": 7,
    "content": "Global sea levels have risen by about 20 cm since 1900."
  },
  {
    "id": 8,
    "content": "The frequency of heatwaves has increased dramatically."
  },
  {
    "id": 9,
    "content": "Climate change causes more intense extreme weather events."
  },
  {
    "id": 10,
    "content": "Ocean temperatures in some regions are the warmest in over 100 years."
  },
  {
    "id": 11,
    "content": "Coral reefs are experiencing mass bleaching due to warmer seas."
  },
  {
    "id": 12,
    "content": "Animal migration patterns are shifting toward cooler regions."
  },
  {
    "id": 13,
    "content": "Spring arrives earlier in many parts of the world."
  },
  {
    "id": 14,
    "content": "Boreal forests and tundra are thawing, releasing methane from permafrost."
  },
  {
    "id": 15,
    "content": "Pollinators like bees are declining due to changing seasons and temperatures."
  },
  {
    "id": 16,
    "content": "Higher CO₂ makes plants grow faster but with reduced nutrients."
  },
  {
    "id": 17,
    "content": "Marine animals are migrating poleward, destabilizing fisheries."
  },
  {
    "id": 18,
    "content": "Crop yields are declining due to heat stress and erratic rainfall."
  },
  {
    "id": 19,
    "content": "Diseases like malaria and dengue are spreading to new regions due to warming."
  },
  {
    "id": 20,
    "content": "Air pollution and extreme heat increase mortality risk, especially for the elderly."
  },
  {
    "id": 21,
    "content": "Climate change worsens conflicts and drives forced migration."
  },
  {
    "id": 22,
    "content": "Millions have been displaced due to floods and droughts."
  },
  {
    "id": 23,
    "content": "Rising temperatures impact youth mental health and anxiety."
  },
  {
    "id": 24,
    "content": "Wildfires are becoming more frequent and intense globally."
  },
  {
    "id": 25,
    "content": "Climate-related disasters cause hundreds of billions of dollars in annual losses."
  },
  {
    "id": 26,
    "content": "Insurance companies are raising premiums or refusing to cover high-risk climate zones."
  },
  {
    "id": 27,
    "content": "Energy costs are rising due to increased demand for air conditioning."
  },
  {
    "id": 28,
    "content": "Tourism is affected—ski resorts suffer from less snow, coastal resorts from flooding."
  },
  {
    "id": 29,
    "content": "Work productivity drops in hotter regions due to extreme heat."
  },
  {
    "id": 30,
    "content": "Methane is 80 times more powerful than CO₂ over 20 years."
  },
  {
    "id": 31,
    "content": "Warming oceans release more CO₂, worsening climate feedback loops."
  },
  {
    "id": 32,
    "content": "Tropical forests can turn from carbon sinks to carbon sources if degraded."
  },
  {
    "id": 33,
    "content": "Black carbon (soot) from engines and industry speeds up ice melt."
  },
  {
    "id": 34,
    "content": "Thawing permafrost is releasing ancient viruses once frozen for millennia."
  },
  {
    "id": 35,
    "content": "Peatland fires in Indonesia released more carbon than Japan’s total emissions that year."
  },
  {
    "id": 36,
    "content": "A single cow can emit around 100 kg of methane per year."
  },
  {
    "id": 37,
    "content": "The fashion industry contributes more than 10% of global greenhouse gas emissions."
  },
  {
    "id": 38,
    "content": "Producing one smartphone generates about 50-85 kg of CO₂."
  },
  {
    "id": 39,
    "content": "Data centers account for roughly 2% of global emissions."
  },
  {
    "id": 40,
    "content": "Using bikes or public transport can cut your emissions by up to 1 ton per year."
  },
  {
    "id": 41,
    "content": "Plant-based and locally sourced food has a much smaller carbon footprint."
  },
  {
    "id": 42,
    "content": "One adult tree can absorb about 20–22 kg of CO₂ per year."
  },
  {
    "id": 43,
    "content": "Just 100 companies are responsible for over 70% of industrial emissions since 1988."
  },
  {
  "id": 44,
  "content": "Entire island nations like Tuvalu and the Maldives may become uninhabitable due to rising sea levels."
  },
  {
    "id": 45,
    "content": "Saltwater intrusion from sea-level rise is contaminating freshwater sources on small islands."
  },
  {
    "id": 46,
    "content": "Some Pacific islands are already evacuating residents due to coastal erosion and frequent flooding."
  },
  {
    "id": 47,
    "content": "Island biodiversity is especially vulnerable many endemic species face extinction from habitat loss."
  },
  {
    "id": 48,
    "content": "Coral reef degradation around tropical islands threatens fisheries and local economies."
  },
  {
    "id": 49,
    "content": "Many islands depend heavily on tourism, which is declining due to climate-related damage."
  },
  {
    "id": 50,
    "content": "Island communities often have limited resources to adapt to climate impacts compared to mainland regions."
  },
  {
    "id": 51,
    "content": "Some islands are exploring floating infrastructure as a future proof adaptation strategy."
  },
  {
    "id": 52,
    "content": "Climate refugees from sinking islands may face statelessness if their nations disappear."
  },
  {
    "id": 53,
    "content": "Island mangrove forests are crucial for coastal defense but are rapidly disappearing due to warming seas."
  }
]
